xchorizoxx/ESP32-THERMAL-COUNTER/sdkconfig.defaults
# ============================================================
# sdkconfig.defaults — Detector de Puerta Térmica (ESP32-S3)
# ============================================================
# Modificar aquí para cambiar la configuración de build.
# Ejecutar un fullclean desde el IDE después de cambios aquí.

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_STATIC_TASK_CLEAN_UP=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# --- OTA Rollback (anti-bootloop) ---
# Si el nuevo firmware hace crash antes de llamar esp_ota_mark_app_valid_cancel_rollback(),
# el bootloader revierte automáticamente a la partición anterior válida.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- WiFi ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# --- HTTP Server (WebSocket) ---
CONFIG_HTTPD_WS_SUPPORT=y

# --- LWIP (sockets) ---
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
CONFIG_LWIP_SO_RCVBUF=y

# --- Logging (INFO en producción — menos ruido en monitor) ---
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Tamaño de stack del loop principal ---
# --- Tamaño de stack del loop principal ---
# Se incrementa a 32KB para garantizar estabilidad durante la orquestación 
# inicial y la compleja extracción de parámetros del MLX90640.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# --- I2C (usar driver nativo, no el legado) ---
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# --- Target Device ---
CONFIG_IDF_TARGET="esp32s3"

# --- Particiones Custom para OTA ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
